In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [3]:
%%sql
SHOw tables;

 * mysql+mysqlconnector://root:***@localhost/mydb
14 rows affected.

[('customerdata',),
 ('customers',),
 ('customersdetails',),
 ('customertransactions',),
 ('drivers',),
 ('employee_basic_view',),
 ('employees',),
 ('high_employee_details',),
 ('high_paid_employees',),
 ('orders',),
 ('rides',),
 ('rides1',),
 ('rides2',),
 ('users',)]

In [4]:
%%sql
CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    city VARCHAR(50)
);

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'customers' already exists
[SQL: CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    city VARCHAR(50)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
INSERT INTO customers VALUES
(1, 'Ravi Kumar', 'Chennai'),
(2, 'Priya Sharma', 'Bangalore'),
(3, 'Arjun Mehta', 'Hyderabad'),
(4, 'Meena Gupta', 'Mumbai'),
(5, 'Karthik Raj', 'Chennai');

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'customers.PRIMARY'
[SQL: INSERT INTO customers VALUES
(1, 'Ravi Kumar', 'Chennai'),
(2, 'Priya Sharma', 'Bangalore'),
(3, 'Arjun Mehta', 'Hyderabad'),
(4, 'Meena Gupta', 'Mumbai'),
(5, 'Karthik Raj', 'Chennai');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [6]:
%%sql
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_amount DECIMAL(10,2),
    order_date DATE,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'orders' already exists
[SQL: CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_amount DECIMAL(10,2),
    order_date DATE,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [7]:
%%sql
INSERT INTO orders VALUES
(101, 1, 5000.00, '2025-01-01'),
(102, 2, 10000.00, '2025-01-02'),
(103, 3, 3000.00,  '2025-01-03'),
(104, 4, 1500.00,  '2025-01-04'),
(105, 1, 7000.00,  '2025-01-05'),
(106, 5, 8000.00,  '2025-01-06');

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '101' for key 'orders.PRIMARY'
[SQL: INSERT INTO orders VALUES
(101, 1, 5000.00, '2025-01-01'),
(102, 2, 10000.00, '2025-01-02'),
(103, 3, 3000.00,  '2025-01-03'),
(104, 4, 1500.00,  '2025-01-04'),
(105, 1, 7000.00,  '2025-01-05'),
(106, 5, 8000.00,  '2025-01-06');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [8]:
%%sql
select * from customers

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[(1, 'Ravi Kumar', 'Chennai'),
 (2, 'Priya Sharma', 'Bangalore'),
 (3, 'Arjun Mehta', 'Hyderabad'),
 (4, 'Meena Gupta', 'Mumbai'),
 (5, 'Karthik Raj', 'Chennai')]

In [9]:
%%sql
select * from orders

 * mysql+mysqlconnector://root:***@localhost/mydb
6 rows affected.

[(101, 1, Decimal('5000.00'), datetime.date(2025, 1, 1)),
 (102, 2, Decimal('10000.00'), datetime.date(2025, 1, 2)),
 (103, 3, Decimal('3000.00'), datetime.date(2025, 1, 3)),
 (104, 4, Decimal('1500.00'), datetime.date(2025, 1, 4)),
 (105, 1, Decimal('7000.00'), datetime.date(2025, 1, 5)),
 (106, 5, Decimal('8000.00'), datetime.date(2025, 1, 6))]

In [10]:
%%sql
# Sub query + where 
SELECT customer_name
FROM customers
WHERE customer_id = (
    SELECT customer_id
    FROM orders
    WHERE order_amount = (SELECT MAX(order_amount) FROM orders)
);

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[('Priya Sharma',)]

In [11]:
%%sql
-- WHERE ... NOT IN
-- Find customers who have NEVER placed an order
SELECT *
FROM customers
WHERE customer_id NOT IN (
    SELECT DISTINCT customer_id
    FROM orders
);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [12]:
%%sql
-- 3) WHERE ... EXISTS
-- Find customers who HAVE placed at least one order (existence check; efficient)
SELECT *
FROM customers c
WHERE EXISTS (
    SELECT 1
    FROM orders o
    WHERE o.customer_id = c.customer_id
);

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[(1, 'Ravi Kumar', 'Chennai'),
 (2, 'Priya Sharma', 'Bangalore'),
 (3, 'Arjun Mehta', 'Hyderabad'),
 (4, 'Meena Gupta', 'Mumbai'),
 (5, 'Karthik Raj', 'Chennai')]

In [13]:
%%sql
-- WHERE ... NOT EXISTS
-- Find customers who have NOT placed any order
SELECT *
FROM customers c
WHERE NOT EXISTS (
    SELECT 1
    FROM orders o
    WHERE o.customer_id = c.customer_id
);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [14]:
%%sql
-- Correlated subquery in WHERE
-- Find customers whose total order amount > 10000
SELECT *
FROM customers c
WHERE (
    SELECT COALESCE(SUM(order_amount), 0)
    FROM orders o
    WHERE o.customer_id = c.customer_id
) > 10000;

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(1, 'Ravi Kumar', 'Chennai')]

In [15]:
%%sql
-- Subquery in SELECT (inline) â€” compute total spent per customer
SELECT
    c.customer_id,
    c.customer_name,
    (SELECT COALESCE(SUM(o.order_amount), 0)
     FROM orders o
     WHERE o.customer_id = c.customer_id) AS total_spent
FROM customers c;

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[(1, 'Ravi Kumar', Decimal('12000.00')),
 (2, 'Priya Sharma', Decimal('10000.00')),
 (3, 'Arjun Mehta', Decimal('3000.00')),
 (4, 'Meena Gupta', Decimal('1500.00')),
 (5, 'Karthik Raj', Decimal('8000.00'))]

In [16]:
%%sql
-- Use EXISTS to filter orders (example: orders by customers from Chennai)
SELECT o.*
FROM orders o
WHERE EXISTS (
    SELECT 1
    FROM customers c
    WHERE c.customer_id = o.customer_id
      AND c.city = 'Chennai'
);

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(101, 1, Decimal('5000.00'), datetime.date(2025, 1, 1)),
 (105, 1, Decimal('7000.00'), datetime.date(2025, 1, 5)),
 (106, 5, Decimal('8000.00'), datetime.date(2025, 1, 6))]

In [17]:
%%sql
-- NOT EXISTS with correlated check (safest for NULLs)
-- Customers with no orders (correlated NOT EXISTS avoids issues when orders.customer_id may be NULL)
SELECT *
FROM customers c
WHERE NOT EXISTS (
    SELECT 1 FROM orders o WHERE o.customer_id = c.customer_id
);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]